hotRoom4_B/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2012                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   uniform 0;

boundaryField
{
    inlet
    {
         type            zeroGradient;
    }
    ground
    {
        type            zeroGradient;
    }
    wtwalls
    {
        type            zeroGradient;
    }
    top
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    defaultFaces
    {
        type            zeroGradient;
    }
    buildingFaces_master
    {
        type            zeroGradient;
    }
    buildingFaces_slave
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
